Repository: 84000/data-translation-memory
Catalog: toh555-v3.tmx
Source language: bo
Languages: en

source: མ་ཧཱ་དེ་བེ་ས་ར་ས་ཏྱ་སིདྦྷྱནྟུ་མནྟྲ་པ་དཱ་ནི་སྭཱ་ཧཱ། དེ་ནས་ལྷ་མོ་སྤོབས་པ་ཆེན་མོས་གཟུངས་སྔགས་འདི་བསྟན་ནས་བྲམ་ཟེ་དེ་ལ་འདི་སྐད་ཅེས་ཀྱེ་སྐྱེས་བུ་ཆེན་པོ་སེམས་ཅན་རྣམས་ཀྱི་ཆེད་དུ་སྤོབས་པ་གྱ་ནོམ་པ་དང་། རིན་པོ་ཆེ་དང་། རྫུ་འཕྲུལ་དང་། ཤེས་རབ་ཡོངས་སུ་གཉེར་ནས་ཐམས་ཅད་ལ་རྒྱ་ཆེར་ཕན་བཏགས་ཏེ་མྱུར་དུ་བྱང་ཆུབ་མངོན་དུ་བྱེད་པར་འདོད་པ་ལེགས་སོ་ལེགས་སོ།
en: The great goddess Sarasvatī, having listened to his supplication, then spoke this dhāraṇī mantra: syād yathedaṃ |mure cire avaje avajavatehigulemigulepigalavatimaguśemaricisamatidaśamati agrima gritaracitaracapaticicirīśirimiri mandhi demakhimaricipraṇayelokajyeṣṭhelokapriyesiddhipritevimamukhi śucikharīapratihateapratehatabuddhenamucinamucimahādevīprati­gṛhnanamaskaraṃ [say your name] mama buddhi viśduddhi bhagavadtyaṃ bevayaṃ sparasatya karade keyūre keyūramati hilimili apayame mahādeve buddhasatyana dharmasatya saṃghasatyena indrasatyena varuṇasatyena yeloke stayasatyena teśamastyena sattivadcanini avahayami mahādevem hilimili hilimili vicidato [say your name] mama buddhi namo bhavati mahādeve sarasatya sidhyanti mantrapadāni svāhā | Then the great goddess Sarasvatī, having taught this dhāraṇī mantra, said to the brahmin, “O great being, it is excellent, excellent that for the sake of beings you provide wonderful eloquence, jewels, miracles, and wisdom, bringing a vast benefit to all, and that you wish to bring them quickly to enlightenment.

source: །དེ་ལྟར་ཤེས་པར་བྱས་ནས་ཆོ་ག་འདི་གཟུང་བར་བྱའོ།
en: Know that and possess this rite.”

source: །ཞེས་སྨྲས་ནས་ཡང་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ། ཐོག་མ་ཁོ་ནར་གཟུངས་འདི་ཁ་ཏོན་དུ། །བྱང་ཞིང་ནོར་བ་མེད་པར་བཀླགས་ནས་ནི། །བྱིན་གྱིས་རློབ་ཅིང་སྨོན་པ་རྫོགས་བྱའི་ཕྱིར། །དཀོན་མཆོག་གསུམ་དང་ལྷ་རྣམས་སྐྱབས་འགྲོ་ཞིང་།
en: Having said that, she recited these verses: To recite this dhāraṇī, at the beginning Just read it purely and without error, And then go for refuge to the Three Jewels and the devas In order to be blessed and have your prayers be fulfilled. “

source: །སངས་རྒྱས་ཆོས་དང་བྱང་ཆུབ་སེམས་དཔའ་དང་། །རང་རྒྱལ་ཉན་ཐོས་ཚོགས་ལ་གུས་ཕྱག་བྱས།
en: Bow with reverence to the buddhas, the Dharma, and The saṅghas of bodhisattvas, pratyekabuddhas, and śrāvakas. “

source: །དེ་འོག་ཚངས་དང་བརྒྱ་བྱིན་ལྷ་དབང་དང་། །འཇིག་རྟེན་སྐྱོང་དང་རྒྱལ་པོ་ཆེན་པོ་བཞིས། །རྟག་པར་ཚངས་པར་སྤྱོད་པ་ཐམས་ཅད་ལ། །རྩེ་གཅིག་ཡིད་ཀྱིས་གུས་པར་ཕྱག་བྱས་ནས།
en: After that, bow with single-minded reverence To Brahmā, Śakra, the lord of devas, The world guardians, the Four Mahārājas, And to all those who continually practice celibacy. “

source: །དགོན་པ་རབ་ཏུ་དབེན་པའི་གནས་དག་ཏུ། །སྐད་ཆེར་སྔ་མའི་སྔགས་དང་ཆོ་ག་གདོན།
en: Then, in a very solitary wilderness, Recite the preceding mantra and ritual in a loud voice.

source: །སངས་རྒྱས་སྐུ་གཟུགས་ལྷ་ཀླུའི་མདུན་དག་ཏུ། །ཇི་ཙམ་འབྱོར་བས་མཆོད་པ་བསྒྲུབ་པར་བྱ།
en: In front of a statue of the Buddha, and before devas and nāgas, Accomplish making offerings with whatever you possess. “

source: །སེམས་ཅན་རྣམ་པ་དེ་དག་ཐམས་ཅད་ལ། །བྱམས་དང་སྙིང་རྗེས་བརྩེ་བའི་སེམས་ཀྱང་བསྐྱེད།
en: Develop a motivation of love, compassion, and kindness Toward all those forms of beings.

source: །བཅོམ་ལྡན་གསེར་སྐུ་ཤིན་ཏུ་གྱ་ནོམ་མཚན། །གཡེང་བ་མེད་སེམས་རྩེ་གཅིག་དྲན་པར་བྱ།
en: Keep in mind—one-pointedly, without distraction— The Bhagavat’s golden body with its wonderful signs. “

source: །བཅོམ་ལྡན་ཡང་དག་ཆོས་སྟོན་དགོངས་མཛད་པས། །དབང་པོ་ཇི་བཞིན་ཏིང་འཛིན་སྒོམ་ལ་འགོད།
en: The Bhagavat had the intention to teach the true Dharma And established beings in samādhi according to their capacities.

source: །དེ་ཡི་ཚིག་གི་དོན་ནི་ལེགས་སོམས་ལ། །སྟོང་པ་ཉིད་བརྟེན་རབ་ཏུ་བསྒོམ་པར་གྱིས།
en: Contemplate well the meaning of these words And meditate perfectly, in reliance upon emptiness. “

source: །བཅོམ་ལྡན་སྐུ་གཟུགས་དག་གི་སྤྱན་སྔར་ནི། །རྩེ་གཅིག་ཡང་དག་དྲན་པས་གནས་བྱེད་ན། །གྱ་ནོམ་ཡེ་ཤེས་ཏིང་ངེ་འཛིན་དག་དང་། །གཟུངས་མཆོག་དམ་པ་དག་ཀྱང་འཐོབ་པར་འགྱུར།
en: If in the presence of an image of the Bhagavat You can remain in genuine, one-pointed mindfulness, Then you will obtain excellent wisdom, samādhi, And the sublime, supreme dhāraṇī. “

source: །བཅོམ་ལྡན་གསེར་ཞལ་ཡང་དག་ཆོས་བསྟན་ནས། །གྱ་ནོམ་དབྱངས་ཀྱིས་ལྷ་མི་འདུལ་བར་མཛད།
en: The golden mouth of the Bhagavat taught the Dharma, And he guided devas and humans with his beautiful voice.

source: །ལྗགས་མཚན་རྐྱེན་བཞིན་ངོ་མཚར་རབ་སྟོན་པས། །ཡངས་རིང་སྟོང་གསུམ་འཇིག་རྟེན་ཁྱབ་པར་མཛད།
en: The sign that is his tongue manifests a wonder according to conditions— It becomes vast and long and covers the worlds of the trichiliocosm. “

source: །བཅོམ་ལྡན་གསུང་དབྱངས་གྱ་ནོམ་དེ་འདྲ་བ། །རྩེ་གཅིག་དྲན་ན་སེམས་ལ་འཇིགས་མེད་འཐོབ།
en: If you keep your mind one-pointed upon that beautiful Speech of the Bhagavat, you will attain fearlessness.

source: །བཅོམ་ལྡན་སྨོན་ལམ་རྒྱ་ཆེན་བཏབ་པའི་དབང་། །ལྗགས་མཚན་བསམ་གྱིས་མི་ཁྱབ་འདི་བརྙེས་ནས།
en: This inconceivable sign that is his tongue was acquired Through the power of the vast prayers of the Bhagavat. “

source: །ཆོས་རྣམས་ཡོད་པ་མ་ཡིན་གསུང་མཛད་པས། །དཔེར་ན་ནམ་མཁའ་ཆགས་པ་མེད་པ་འདྲ།
en: He taught that phenomena have no existence And are like space that is devoid of impediments.

source: །བཅོམ་ལྡན་གསུང་དབྱངས་དག་དང་ལྗགས་མཚན་རྣམས།
en: By contemplating and evaluating the Bhagavat’s speech, The sign of his tongue, your prayers will be fulfilled. “

source: །དྲན་པ་ཉེ་གཞག་གཞལ་བྱེད་སྨོན་རྫོགས་འགྱུར། །གལ་ཏེ་ལྷ་མོ་སྤོབས་ཆེན་མཆོད་མཐོང་ངམ། །སློབ་མས་སློབ་དཔོན་རྗེས་སློབ་མཐོང་ནས་ནི། །གསང་བའི་ཆོ་ག་འདི་བླངས་སྒོམ་བྱེད་དམ། །བླ་མར་བྱེད་ན་སེམས་ལ་བསམ་པ་འགྲུབ།
en: If the great goddess Sarasvatī sees offerings, Or sees a pupil following a master’s instructions And practicing and meditating on this secret rite Or revering it, their wishes will be accomplished. “

source: །གང་ཞིག་ཡེ་ཤེས་དམ་པ་མཆོག་འདོད་ན། །རྩེ་གཅིག་སེམས་ཀྱིས་ཆོས་འདི་གཟུང་བར་བྱ།
en: Someone who wishes for perfect, sublime wisdom Should single-mindedly possess this rite.

source: །བསོད་ནམས་ཡེ་ཤེས་ཡོན་ཏན་འཕེལ་བྱེད་པས། །ངེས་པར་འགྲུབ་འགྱུར་ཐེ་ཙོམ་ཡོངས་མ་བསྐྱེད།
en: It will increase merit, wisdom, and qualities And will have definite accomplishment, have no doubt! “

source: །ནོར་ཚོལ་དག་ནི་ནོར་མང་རྙེད་པར་འགྱུར།
en: Those who seek wealth will obtain great wealth.

source: །གྲགས་པ་གཉེར་བ་གྲགས་ཆེན་ཐོབ་པར་འགྱུར།
en: Those who seek fame will attain great fame.

source: །ངེས་འབྱུང་ཚོལ་བ་རྣམ་པར་གྲོལ་འགྱུར་བས།
en: Those who seek deliverance will be delivered.

source: །ངེས་པར་འགྲུབ་འགྱུར་ཐེ་ཙོམ་ཡོངས་མ་བསྐྱེད།
en: This will definitely be attained, have no doubt! “

source: །ཡོན་ཏན་ཚད་མེད་མཐའ་ལས་ཇི་སྙེད་པ། །སེམས་ལ་བསམས་བཞིན་ཡོངས་སུ་སྡུད་པར་བྱེད།
en: Contemplate and gather into your mind All countless, endless good qualities.

source: །གལ་ཏེ་དེ་ལྟར་ཆོས་བཞིན་སྤྱོད་ནུས་ན། །ངེས་པར་འགྲུབ་འགྱུར་ཐེ་ཙོམ་ཡོངས་མ་བསྐྱེད།
en: If you are able to practice in this way in accord with the Dharma, They will definitely be attained, have no doubt! “

source: །གཙང་མའི་གནས་སུ་གོས་སར་བགོས་ནས་ནི།
en: In a clean place, wear new clothes.

source: །དཀྱིལ་འཁོར་ཆེ་ཆུང་ཅི་ཙམ་ནུས་པར་བྱ།
en: Create a maṇḍala of whatever size you can.

source: །བུམ་པ་གཙང་མ་བཞིར་ནི་རོ་ཞིམ་བཀང་། །མེ་ཏོག་པོག་སྤོས་ཅི་འབྱོར་མཆོད་པར་བྱ། །ལྡ་ལྡི་བ་དན་དག་དང་གདུགས་བྲེས་ཏེ།
en: Fill four clean vases with a delicious flavor And offer whatever flowers and incense you have. “

source: །བྱུག་སྤོས་ཕྱེ་མ་ཀུན་དུ་ཁྱབ་བརྒྱན་ནས།
en: Beautify it with streamers, flags, and parasols, And adorn it everywhere with scented ointment and powders.

source: །སངས་རྒྱས་ལྷ་མོ་སྤོབས་ཆེན་མཆོད་བྱེད་ན། །ལྷ་ལུས་མཐོང་བར་འདོད་ནའང་སྨོན་བཞིན་འགྲུབ།
en: If you make offerings to the buddhas and the goddess Sarasvatī, And wish to see the deity’s body, your aspiration will be fulfilled. “

source: །ལྷ་མོ་སྤོབས་ཆེན་མདུན་དུ་སྔ་མའི་སྔགས། །ཞག་ནི་ཉི་ཤུ་རྩ་གཅིག་གདོན་པར་བྱ།
en: In front of the great goddess Sarasvatī, Recite the previous mantra for twenty-one days.

source: །གལ་ཏེ་ལྷ་དེ་མཐོང་བར་མ་གྱུར་ན། །རྩེ་གཅིག་སེམས་ཀྱིས་ཞག་དགུ་དྲན་པར་བྱེད།
en: If you still have not seen that deity, One-pointedly keep her in mind for nine more days. “

source: །ནམ་གྱི་ཆ་སྨད་འོན་ཀྱང་མ་མཐོང་ན། །གནས་གཙང་དམ་པ་གཞན་དག་བཙལ་ནས་ནི།
en: If she has still not been seen in the last part of the night, Seek another excellent and clean place.

source: །ལྷ་མོ་སྤོབས་ཆེན་གཟུགས་ནི་རབ་བྲིས་ཏེ། །མཆོད་གནས་བཟླས་བརྗོད་སེམས་ཀྱིས་མི་བཏང་ཞིང་།
en: Draw an image of the great goddess Sarasvatī And do not give up offering, repeating, and reciting. “

source: །གཉིད་དང་ལེ་ལོ་སེམས་ནི་མི་བསྐྱེད་ན། །བདག་དང་གཞན་ལ་ཕན་འདོགས་མཐར་ཐུག་མེད།
en: If you do not develop a sleepy or a lazy mind, The benefit to yourself and others will have no end.

source: །རྣམ་སྨིན་གང་ཐོབ་སྐྱེ་དགུ་སྨིན་བྱེད་ན། །སྨོན་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་འགྱུར།
en: If whatever ripening you obtain is made to ripen for beings, Then all your aspirations will be completely accomplished. “

source: །གལ་ཏེ་ཡིད་བཞིན་མ་གྲུབ་ཟླ་བ་གསུམ། །ཡང་ན་དྲུག་དང་དགུ་དང་ལོ་གཅིག་པར། །རབ་བརྩོན་གསོལ་འདེབས་སེམས་ནི་མི་གཡོ་ན། །ལྷ་ཡི་མིག་དང་གཞན་སེམས་ཤེས་ཐོབ་འགྱུར།
en: If you have not attained what you wish, then after three months, Or after six months, nine months, or a year, With diligent supplication and an undistracted mind, You will attain divine vision and knowledge of the minds of others.”

source: །དེ་ནས་བྲམ་ཟེ་ཀཽཎྜི་ནྱས་དེ་སྐད་ཅེས་བསྟན་པ་ཐོས་པ་དང་། དགའ་མགུ་རངས་ཤིང་ངོ་མཚར་དུ་གྱུར་པས་འཁོར་མང་པོ་རྣམས་འདི་སྐད་ཅེས་ཀྱེ་ཁྱེད་ཅག་ལྷ་དང་མིའི་འཁོར་མང་པོ་ཐམས་ཅད་ཤེས་པར་བྱོས་ལ།
en: The Kauṇḍinya brahmin, on hearing those words taught, was then joyous, delighted, and amazed, and so he said to that great assembly, “Oh, all of you, this great assembly of devas and humans, know this!

source: སེམས་རྩེ་གཅིག་ཏུ་དེང་བདག་གིས་ཀུན་རྫོབ་ཀྱི་བདེན་པའི་ཆོས་ལ་བརྟེན་ནས་ལྷ་མོ་སྤོབས་པ་མཆོག་དམ་པ་དེ་དག་ལ་བསྔགས་པ་བརྗོད་པ་ཉོན་ཅིག །
en: Today, on the basis of relative phenomena, I am going to recite a praise to the great goddess Sarasvatī. Listen!”

source: ཅེས་སྨྲས་ནས་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ། འཇིག་རྟེན་དག་ན་དབང་ཕྱུག་ཐོབ་འགྱུར་བ། །ལྷ་མོ་མཐུ་ཆེན་ཐོབ་ལ་གུས་ཕྱག་འཚལ།
en: He then recited these verses: “I reverently pay homage to the goddess Nārāyaṇī, Who has attained dominion over worlds.

source: །དེང་བདག་གཙོ་མོ་དེ་ལ་བསྔགས་པ་ཡང་། སྔོན་གྱི་དྲང་སྲོང་ཇི་སྐད་བསྟན་པ་བཞིན།
en: Today I will praise that supreme one In accordance with the teaching of past ṛṣis. “

source: །བཀྲ་ཤིས་ཡོངས་རྫོགས་སེམས་ནི་བདེ་བར་གནས།
en: Your mind of perfect auspiciousness dwells in bliss.

source: །སེམས་གསལ་ངོ་ཚ་ཁྲེལ་ཡོད་གྲགས་དང་ལྡན།
en: Your clear mind possessed of shame and conscience is renowned.

source: །མ་མ་བྱས་ཏེ་འཇིག་རྟེན་རབ་ཏུ་བསྐྱེད།
en: You are a mother and give birth to the world.

source: །རབ་དཔའ་རྟག་པར་བརྩོན་འགྲུས་ཆེན་པོ་སྤྱོད།
en: You courageously and continuously act with great diligence. “

source: །ཐབ་མོའི་གཡུལ་དུ་རྟག་པར་རྒྱུན་དུ་རྒྱལ།
en: You are always continuously victorious on the battleground.

source: །རབ་དུལ་བྱམས་སེམས་བཟོད་པ་གསོལ་བར་བྱེད།
en: You request self-control, a loving mind, and patience.

source: །ད་ལྟར་གཤིན་རྗེའི་སྲིང་མོ་ཆེན་མོར་གྱུར། །གོས་སུ་རྟག་པར་དར་ཚོན་སྔོན་པོ་གྱོན།
en: You are now the eldest sister of Yama, And for clothes you always wear blue silk. “

source: །སྡུག་དང་མི་སྡུག་བྱད་བཞིན་ཀུན་དང་ལྡན།
en: You possess both beautiful and ugly forms.

source: །མིག་ནི་མཐོང་བ་ཐམས་ཅད་རབ་ཏུ་དངང་།
en: All who see your eyes become afraid.

source: །སྤྱོད་མཆོག་དམ་པ་ཚད་མེད་འཇིག་རྟེན་འདས།
en: Your immeasurable, sublime, supreme activity transcends the world.

source: །ཕྱོགས་ཤིང་མངོན་དང་མི་ཀུན་ཡོངས་སུ་སྡུད།
en: You directly regard all humans and gather them all. “

source: །རེས་འགའ་རི་བྲག་ཟབ་མོ་དག་ན་གནས། །རེས་འགའ་བྲག་ཕུག་གཙང་པོའི་འགྲམ་ན་གནས། །རེས་འགའ་ལྗོན་ཤིང་ནགས་ཚལ་ཆེན་པོར་གནས། །ལྷ་མོ་ཕལ་ཆེར་དེ་དག་ཀུན་དུ་གནས།
en: Sometimes you dwell on profound mountains of rock, Sometimes you dwell in caves or on riverbanks, And sometimes you dwell in great forests of trees— Goddess, those are the places where you primarily dwell. “

source: །རི་དང་ནགས་ཚལ་མི་རྒོད་ཇི་སྙེད་པ། །རྟག་པར་ལྷ་མོ་ལ་ནི་མཆོད་པར་བྱེད།
en: All wild people of the mountains and forests Continually make offerings to you, the goddess.

source: །རྨ་བྱའི་སྒྲོས་ནི་རྒྱལ་མཚན་བ་དན་བྱེད། །དུས་སོ་ཅོག་ཏུ་རྟག་པར་འཇིག་རྟེན་སྐྱོང་།
en: They make banners and flags from peacock feathers, And you protect the world at all times. “

source: །སྟག་དང་སེང་གེ་སྤྱང་ཀིས་རྒྱུན་དུ་བསྐོར།
en: You are always encircled by tigers, lions, and wolves.

source: །གནག་ལུག་བྱ་ལ་སོགས་པས་རྟེན་ཡང་འཆའ།
en: Cattle, sheep, chickens, and so on, depend upon you.

source: །དྲིལ་ཆེན་བསྒྲགས་ནས་སྒྲ་ནི་ཕྱུང་བས་ན། །བིན་དྷའི་རི་ལ་སྒྲ་ནི་ཀུན་དུ་གྲགས།
en: When you ring a great bell, the sound that emerges Resounds even on the Vindhya Mountains. “

source: །རེས་འགའ་རྩེ་གསུམ་ཏྲི་ཤཱུལ་ཐོགས་བྱེད་ཅིང་། །གཡས་གཡོན་རྒྱུན་དུ་ཉི་ཟླ་རུ་མཚོན་འཛིན།
en: Sometimes you hold a trident, And usually your right and left hands hold sun and moon standards.

source: །ཟླ་བ་ནག་པོའི་ཚེས་དགུ་བཅུ་གཅིག་ལ། །དེ་ཡི་དུས་སུ་རྟག་པར་མཆོད་པར་བྱ།
en: On the ninth and eleventh day of the waning moon, I will always make offerings to you at those times. “

source: །རེས་འགའ་བ་སུ་ལྷ་ཆེན་སྲིང་མོར་སྟོན། །གཡུལ་འགྱེད་མཐོང་ན་རྟག་པར་སྙིང་ཡང་བརྩེ། །སེམས་ཅན་ཐམས་ཅད་རྣམ་པར་ལྟ་བ་ལ།
en: Sometimes you manifest as Vasu, the sister of Mahādeva, Who, on seeing a battle, always has kindness And is always looking upon all beings.

source: །ལྷ་མོ་མཆོག་ཏུ་གྱུར་པས་བདས་པ་མེད།
en: You are a supreme goddess whom no one transcends. “

source: །རེས་འགའ་བ་རྫིའི་བུ་མོ་དགའ་མོར་སྟོན། །ལྷ་དང་འཐབ་ཚེ་རྟག་པར་རྒྱལ་བ་འཐོབ།
en: Sometimes you manifest as the gopi Rādhā, And when you fight the devas, you are always victorious.

source: །འཇིག་རྟེན་དག་ན་ཡུན་རིང་གནས་པར་བྱེད། །རབ་དུལ་བཟོད་དང་ཁྲོ་གཏུམ་སྟོན་པར་བྱེད།
en: You remain in worlds for a long time, Manifesting both subdued patience and wrath. “

source: །བྲམ་ཟེ་ཆེན་པོ་རིག་པའི་ཆོས་བཞི་དང་། །སྒྱུ་འཕྲུལ་སྔགས་སོགས་ཐམས་ཅད་རབ་ཏུ་རྟོགས།
en: You have perfectly understood all the four Dharmas Known by great brahmins, and miracles, mantras, and so on.

source: །དྲང་སྲོང་ནང་ན་རང་དབང་དག་དང་ལྡན། །ས་བོན་དང་ནི་ས་ཆེན་བྱེད་པར་ནུས།
en: Among the ṛṣis, you have attained independent power And have the ability to create seeds and this great earth. “

source: །ལྷ་མོ་བུ་མོ་ལ་སོགས་འདུས་པའི་ཚེ། །རྒྱ་མཚོའི་རླབས་ལྟར་ངེས་པར་དེར་ཡང་འདུ།
en: When goddesses and so on gather Like ocean waves, they gather around you.

source: །ཀླུ་དང་གནོད་སྦྱིན་མང་པོའི་ཚོགས་ཀུན་གྱི། །གཙོ་བོར་གྱུར་པས་རབ་ཏུ་དུལ་བར་བྱེད།
en: You are chief among all the assemblies of many yakṣas, nāgas, And so on, and you have the power to guide them. “

source: །བུད་མེད་ནང་ན་ཚངས་སྤྱོད་མཆོག་དང་ལྡན།
en: You are the supreme female celibate.

source: །ཚིག་བྱུང་དཔེར་ན་འཇིག་རྟེན་བདག་པོ་འདྲ།
en: Your words arise like those of the lord of the world.

source: །རྒྱལ་པོའི་གནས་ན་པདྨ་དག་དང་མཚུངས།
en: You are like lotuses in a royal residence.

source: །ཆུ་བོའི་འགྲམ་ན་གནས་ཚེ་གྲུ་ཟབ་བཞིན།
en: On the banks of a river, you are like a boat or a bridge. “

source: །བྱད་བཞིན་སྡུག་མཛེས་ཟླ་བ་ཉ་བ་འདྲ།
en: Your beautiful face is like the full moon.

source: །མང་ཐོས་ཕུན་ཚོགས་གནས་དང་རྟེན་ཡང་བྱེད།
en: You are a support and basis for the greatly learned.

source: །སྤོབས་པ་མཆོག་བྱུང་རི་རྩེ་མཐོན་པོ་འདྲ།
en: Your supreme eloquence is like a high mountain peak.

source: །དྲན་པ་ཐམས་ཅད་ཀུན་གྱི་གླིང་ཡང་བྱེད།
en: You create an island for those who keep you in mind. “

source: །ལྷ་མ་ཡིན་ལ་སོགས་ཏེ་ལྷ་ཚོགས་རྣམས། །ཐམས་ཅད་འདི་ཡི་ཡོན་ཏན་བསྔགས་པར་བྱེད།
en: The devas, such as the asuras, and so on, All recite praises of your qualities.

source: །མིག་སྟོང་བརྒྱ་བྱིན་ལྷ་ཡི་དབང་པོས་ཀྱང་། །གུས་པའི་སེམས་ཀྱིས་ལྟ་ཞིང་རབ་ཏུ་རྟོག །
en: Even thousand-eyed Śakra, the lord of devas, Gazes on you and thinks of you with veneration. “

source: སེམས་ཅན་གང་ཞིག་རེ་ཞིང་ཚོལ་བ་ཡོད། །དེ་དག་ཐམས་ཅད་མྱུར་དུ་འགྲུབ་པར་བྱེད།
en: Whatever beings wish for and seek, You quickly accomplish all of it.

source: །ཡིད་མྱུར་སྤོབས་དང་ཆོས་འཛིན་ལྡན་བྱེད་པས། །ས་ཆེན་སྟེང་ན་མཆོག་ཏུ་གྱུར་པ་ཡིན།
en: You have a swift mind, eloquence, and you possess the Dharma So that you are supreme upon this great earth. “

source: །ཕྱོགས་བཅུའི་འཇིག་རྟེན་ཁམས་ནི་འདི་དག་ཏུ། །མར་མེ་ཆེ་ལྟར་རྟག་པར་ཀུན་གསལ་བྱེད།
en: In these world realms of the ten directions, You always illuminate everything, like a great lamp.

source: །ཐ་ན་ལྷ་འདྲེ་གཅན་གཟན་དག་ལ་ཡང་། །དེ་དག་བསམས་བཞིན་ཐམས་ཅད་རྫོགས་བྱེད་འགྱུར།
en: You even fulfill all the wishes Of the spirits and wild beasts. “

source: །བུད་མེད་རྣམས་ཀྱི་ནང་ན་རི་རྩེ་འདྲ།
en: You are like a mountain peak among females.

source: །སྔོན་གྱི་དྲང་སྲོང་ཇི་བཞིན་ཡུན་རིང་གནས།
en: Like the ṛṣis of the past, you remain for a long time.

source: །ལྷ་མོ་གཞོན་ནུ་ཇི་བཞིན་འདོད་ཆགས་སྤངས། །འཇིག་རྟེན་བདག་པོ་ཇི་བཞིན་བདེན་ཚིག་སྨྲ།
en: Like a young goddess, you are devoid of desire, And you speak the truth like the lord of the world. “

source: །འཇིག་རྟེན་ཀུན་གྱི་ཁྱད་པར་རྒྱན་རྣམས་དང་། །འདོད་ཁམས་ལྷ་ཡི་ཁང་པ་ཀུན་བལྟས་ན། །ལྷ་མོ་འབའ་ཞིག་གཙོ་མོར་གྲགས་པས་ན། །སེམས་ཅན་མཆོག་ཏུ་གྱུར་པ་ཡོངས་མི་སྣང་།
en: You are the one goddess renowned as supreme Within the continuity of all the worlds, And over those in the divine palaces of the desire realm; There is no being who appears to be greater. “

source: །གལ་ཏེ་གཡུལ་འགྱེད་འཇིགས་པའི་གནས་དག་དང་། །མེ་དོང་ལྷུང་བ་བདག་ནི་མཐོང་བར་གྱུར།
en: If I am in battle or a dangerous place Or fall into a pit of fire, you will see me.

source: །ཆུ་བོ་ཉམ་ང་ཆོམ་རྐུན་འཇིགས་པའི་ཚེ། །འཇིགས་པ་དེ་དག་ཐམས་ཅད་སེལ་བར་ནུས།
en: When there are the dangers of dreadful rivers and bandits, You have the power to dispel all those dangers. “

source: །གལ་ཏེ་རྒྱལ་པོའི་ཁྲིམས་ཀྱིས་བཅིངས་བསྒྲོགས་སམ། །གལ་ཏེ་ཤ་ཆགས་གསོད་པར་བྱེད་པའི་ཚེ། །སེམས་ནི་རྩེ་གཅིག་མི་གཡོ་གནས་གྱུར་ན། །ངེས་པར་མྱ་ངན་སྡུག་བསྔལ་ཀུན་ལས་ཐར།
en: If you are chained by the laws of the king Or are being killed by someone who wants your flesh, If at that time you maintain an unwavering, single-pointed mind, You will definitely be freed from your suffering. “

source: །དགེ་སྡིག་མི་ཀུན་ཡོངས་སུ་སྐྱོབ་པས་ན། །བྱམས་དང་སྙིང་རྗེའི་བརྩེ་བ་རྟག་མངོན་སྣང་།
en: You protect all humans, good and bad, And always manifest love and the affection of compassion.

source: །དེ་ཕྱིར་བདག་ནི་བསམ་པ་རྩེ་གཅིག་ཏུ། །ལྷ་མོ་ཆེ་ལ་ཕྱག་འཚལ་སྐྱབས་སུ་མཆི།
en: Therefore, with single-minded aspiration, I pay homage and take refuge in you, the great goddess.”

source: །དེ་ནས་བྲམ་ཟེ་དེས་སྔགས་དང་། བསྔགས་པ་བརྗོད་པའི་ཚིག་གིས་ལྷ་མོ་དེ་ལ་མངོན་པར་བསྟོད་པ། འཇིག་རྟེན་གཙོ་ལ་ཕྱག་འཚལ་གུས་ཕྱག་འཚལ།
en: Then the brahmin extolled that goddess with words of praise and eulogy: “Supreme in the world, I reverently pay homage to you.

source: །མི་རྣམས་ནང་ན་ཀུན་གྱི་མཆོག་གྱུར་པས།
en: You are supreme among all mothers.

source: །འཇིག་རྟེན་གསུམ་པོ་ཐམས་ཅད་ཁྱོད་ལ་མཆོད།
en: Therefore, all the three worlds make offerings to you.

source: །བྱད་བཞིན་རབ་མཛེས་ཀུན་གྱིས་བལྟ་བར་མོས།
en: Your appearance is beautiful, and all long to see you. “

source: །ཡོན་ཏན་རྣམ་པ་སྣ་ཚོགས་ལུས་རབ་བརྒྱན།
en: Your body is adorned with various good qualities.

source: །མིག་ཡངས་པདྨ་སྔོན་པོའི་འདབ་མ་འདྲ།
en: Your wide eyes are like the petals of the blue lotus.

source: །བསོད་ནམས་ཡེ་ཤེས་སྣང་བའི་གྲགས་པས་རྒྱས།
en: You have the vast renown of the radiance of merit and wisdom.

source: །དཔེར་ན་རིན་ཐང་མེད་པའི་ནོར་བུ་མཚུངས།
en: To give an analogy, you are the same as a priceless jewel. “

source: །དེང་བདག་དམ་པ་ཁྱོད་ལ་བསྔགས་པས་ན། །སེམས་ལ་བསམ་པ་ཐམས་ཅད་འགྲུབ་པར་འགྱུར།
en: On this day I speak this praise of you, sublime one, And may you accomplish all the wishes in my mind.

source: །ཡང་དག་ཡོན་ཏན་བཀྲ་ཤིས་གྱ་ནོམ་པ།
en: You have true qualities and excellent auspiciousness.

source: །པདྨ་ལྟ་བུར་ཤིན་ཏུ་རྣམ་པར་དག །
en: You are completely pure, like a lotus. “

source: ལུས་མདོག་རབ་མཛེས་ཀུན་གྱིས་བལྟ་བར་མོས།
en: Your body has a beautiful color and all long to see it.

source: །མཚན་མང་ངོ་མཚར་བསམ་གྱིས་ཡང་མི་ཁྱབ།
en: You have an inconceivable multitude of wonderful features.

source: །དྲི་མེད་ཡེ་ཤེས་འོད་ཟེར་རབ་འགྱེད་པས། །དྲན་པས་ཀུན་གྱི་ནང་ན་མཆོག་ཏུ་གྱུར།
en: You spread the light rays of stainless wisdom, And your memory is supreme over all others. “

source: །ཇི་ལྟར་སེང་གེ་གཅན་གཟན་མཆོག་གྱུར་ལྟར།
en: You are supreme like a lion among wild beasts.

source: །རྟག་པར་ལག་པ་བརྒྱད་ཀྱིས་བདག་ཉིད་བརྒྱན། །སོ་སོར་མདའ་གཞུ་རལ་གྲི་སྟ་རེ་དང་། །ཐོ་རིངས་ལྕགས་ཀྱི་འཁོར་ལོ་ཞགས་པ་ཐོགས།
en: You are ever adorned by eight arms That hold, individually, an arrow, bow, sword, Axe, mallet, hook, discus, and noose. “

source: །རབ་མཛེས་ལྷ་མོ་ཟླ་བ་ཉ་བ་འདྲ།
en: Beautiful goddess, you are like the full moon.

source: །ཚིག་ལ་ཐོགས་མེད་དབྱངས་སྙན་འབྱིན་པར་བྱེད།
en: You emit a beautiful voice with unimpeded words.

source: །སེམས་ཅན་གང་ཞིག་སེམས་ལ་སྨོན་ཡོད་ན། །སྐྱེས་བུ་དམ་པས་བསམས་བཞིན་རྫོགས་པར་བྱེད།
en: Whatever being has a prayer in their minds, You, sublime being, will fulfill their wishes. “

source: །བརྒྱ་བྱིན་ལྷ་མང་ཀུན་གྱིས་ཁྱོད་མཆོད་ནས།
en: Śakra and many devas all make offerings to you.

source: །ཐམས་ཅད་བསྔགས་བརྗོད་སྐྱབས་སུ་འགྲོ་བར་བྱེད།
en: They all praise you and go to you for refuge.

source: །བསམ་གྱིས་མི་ཁྱབ་ཡོན་ཏན་སྐྱེད་བྱེད་པས། །དུས་རྣམས་རྟག་ཏུ་གུས་པ་སྐྱེད་པར་བྱེད་སྭཱ་ཧཱ།
en: You give rise to inconceivable qualities, So at all times I venerate you: svāhā. “

source: །གལ་ཏེ་སྤོབས་ཆེན་ལྷ་མོ་གསོལ་འདོད་ན། །བསྔགས་བསྟོད་ཚིག་ནི་འདི་ལས་འབྱུང་བ་བཞིན། །ནད་པར་རྣམ་དག་སེམས་ཀྱིས་རྩེ་གཅིག་གདོན།
en: If you wish to pray to the great goddess Sarasvatī, Use these words of praise and eulogy And recite them with internal purity, single-mindedly.

source: །བསམ་པའི་དངོས་པོ་ཐམས་ཅད་བསམས་བཞིན་འགྲུབ།
en: Then all that you aspire for will be accomplished as you wish.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྲམ་ཟེ་དེ་ལ་ཁྱོད་ཀྱིས་སེམས་ཅན་རྣམས་ལ་ཕན་གདགས་ཤིང་བདེ་བ་སྦྱིན་པའི་ཆེད་དུ། ལྷ་མོ་དེ་ལ་བསྔགས་པ་བརྗོད་པས་བྱིན་གྱིས་རློབ་པར་གསོལ་བ་བཏབ་ནས། བསོད་ནམས་དཔག་ཏུ་མེད་པ་འཐོབ་པར་འགྱུར་བ་ལེགས་སོ་ལེགས་སོ་ཞེས་བཀའ་སྩལ་ཏོ།། །།གསེར་འོད་དམ་པ་མཆོག་ཏུ་རྣམ་པར་རྒྱལ་བ་མདོ་སྡེའི་རྒྱལ་པོ། །བམ་པོ་བརྒྱད་པ།
en: The Bhagavat said to the brahmin, “It is excellent, excellent that you, in order to benefit and bring happiness to beings, have recited this praise to the goddess and prayed for her blessing so that immeasurable merit will be obtained.”

source: དེ་ནས་བྲམ་ཟེ་ཀཽཎྜི་ནྱས་གོང་དུ་བསྟན་པ་དེ་ལྟ་བུའི་མངོན་པར་བསྟོད་པའི་ཚིག་དང་། སྔགས་ཀྱི་ཚིག་གིས་ལྷ་མོ་སྤོབས་པ་ཆེན་མོ་ལ་མངོན་པར་བསྟོད་ནས་འཁོར་མང་པོ་རྣམས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཁྱེད་ཅག་ལྷ་མོ་སྤོབས་པ་ཆེན་མོ་ལ་གསོལ་བ་བཏབ་ནས་སྙིང་བརྩེ་བས་བྱིན་གྱིས་བརླབས་ནས་ཚེ་འདི་ཉིད་ལ་ཐོགས་པ་མེད་པའི་སེམས་མྱུར་བ་དང་། ཡེ་ཤེས་ཆེན་པོ་དང་། ཚིག་ལ་ཤིན་ཏུ་མཁས་པ་དང་། ཤེས་པ་རྒྱ་ཆེན་པོ་འཐོབ་པ་དང་། འབེལ་བའི་གཏམ་གྱིས་ཕན་ཚུན་ལན་འདེབས་པ་དང་། ཚིག་འབྲུའི་རྒྱན་ཡིད་བཞིན་དུ་གྲུབ་ནས་ཐོགས་པ་མེད་པར་འདོད་ན་སེམས་རྩེ་གཅིག་ཏུ་གུས་པས་འདི་ལྟར་གསོལ་བ་གདབ་པར་བྱའོ།
en: Then the Kauṇḍinya brahmin, having thus, as shown above, extolled the great goddess Sarasvatī with words of praise and words of eulogy, said to the great assembly, “If you wish to pray to the goddess Sarasvatī so that you will be blessed by her compassion, so that in this life you will have a swift, unimpeded mind, great wisdom, and skill in words; attain vast wisdom; communicate with elaborate speech; and accomplish the adornment of words as you wish without impediment, then single-mindedly and reverentially pray in this way: “ ‘I pay homage to the Buddha.

source: །སངས་རྒྱས་ལ་ཕྱག་འཚལ་ལོ། །ཆོས་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to the Dharma.

source: །དགེ་འདུན་ལ་ཕྱག་འཚལ་ལོ། །བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་དང་། རང་སངས་རྒྱས་དང་། ཉན་ཐོས་དང་། འཕགས་པ་ཐམས་ཅད་དང་། འདས་པ་དང་། མ་བྱོན་པ་དང་།
en: I pay homage to the Saṅgha. “ ‘

source: ཕྱོགས་བཅུའི་སངས་རྒྱས་ཡང་དག་པའི་བདེན་ཚིག་མངོན་པར་གྲུབ་པ་དང་། དབང་པོ་ཇི་ལྟ་བ་བཞིན་དུ་ཡང་དག་པའི་བདེན་ཚིག་གསུང་བ། མི་སླུ་བའི་ཚིག་གསུང་བ། བསྐལ་པ་ཆེན་པོ་བྱེ་བ་ཚད་མེད་པ་སྙེད་དུ་རྟག་པར་ཡང་དག་པའི་བདེན་ཚིག་གསུང་ཞིང་། ཡང་དག་པའི་བདེན་ཚིག་དང་ལྡན་པ་ཐམས་ཅད་ལ་རྗེས་སུ་ཡི་རངས་ནས་ཕྱག་འཚལ་ལོ།
en: The community of bodhisattvas, the śrāvakas, the pratyekabuddhas, all āryas, and the buddhas of the past, future, and present in the ten directions have accomplished words of truth; according to their powers they have spoken valid words of truth, they have spoken infallible words, they have constantly spoken words of truth for countless millions of great eons, and I rejoice in and pay homage to all who possess valid words of truth. “ ‘
